// 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
// 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1

// თხოვეთ მომხმარებელს რომ შემოიტანოს რიცხვი 1 დან -100
// მდე,დაბეჭდეთ ყველა კენტი რიცხვი 0 დან მომხმარებლის მიერ
// შემოყვანილ რიცხვამდე

// var number = Number(prompt("enter num between 1-100"));

// while(number<1||number>100){
//     number = Number(prompt("enter CORRECT num between 1-100"));
// }

// for(var i = 0; i<=number; i++){
//     if(i%2==1){
//         console.log(i);
//     }
// }



// 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2
// 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2

// თხოვეთ მომხმარებელს რომ შემოიყვანოს რიცხვი 300 დან 500 მდე,
// შემდგომ დააგენერირეთ რენდომული რიცხვი 50 დან 100 მდე და
// დაბეჭდეთ ყველა 2 ის ჯერადი რიცხვი რენდომულად
// დაგენერირებულ რიცხვსა და მომხმარებლის მიერ შემოყვანილ
// რიცხვს შორის

// var inputNum = Number(prompt("choose number between 300-500"));

// while(inputNum<300||inputNum>500){
//     inputNum = Number(prompt("choose number between 300-500 CORRECTLY"));
// }

// var randomNum = Math.round(Math.random()*50+49);

// for(var i=randomNum; i<inputNum; i++){
//     if(i%2==0){
//         console.log(i);
//     }
// }



// 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3
// 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3

// თხოვეთ მომხმარებელს რომ შემოიტანოს რიცხვი 70 დან 100 მდე და
// დაბეჭდეთ ყველა რიცხვის საშვალო არითმეტიკული 0 დან
// მომხმარებლის მიერ შემოყვანილ რიცხვს შორის

// var inputNum = Number(prompt("choose number between 70-100"));
// var sum = 0;

// while(inputNum<70||inputNum>100){
//     inputNum = Number(prompt("choose number between 70-100 CORRECTLY"));
// }

// for(var i=0; i<inputNum; i++){
//     sum+=i;
// }

// console.log(`საშუალო არის ${sum/inputNum}`);




// 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4
// 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4

// დაბეჭდეთ ყველა 5 ის ჯერადი რიცხვი 0 დან 1600 მდე რომელიც არ
// იყოფა 10 ზე უნაშთოდ.

// for(var i = 0; i<1600; i++){
//     if(i%5==0 && i%10!=0){
//         console.log(i);
//     }
// }


// 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5
// 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5

// თხოვეთ მომხმარებელს რომ შემოიყვანოს რიცხვი 50 დან 100 მდე და
// დაბეჭდეთ კონსოლში მომხმარებლის მიერ შემოყვანილი რიცხვის
// ფაქტორეალი
// Ფაქტორეალის გამომთვლელი ფორმულაა :
// a. 5 ! = 1 * 2 * 3 * 4 * 5; 8! = 1 * 2 * 3 * 4 * 5 * 6 * 7 * 8;

// var inputNum = Number(prompt("choose number between 50-100"));
// var faqtoriali = 1;

// while(inputNum<50||inputNum>100){
//     inputNum = Number(prompt("choose number between 50-100 CORRECTLY"));
// }

// for(i=1;i<=inputNum;i++){
//     faqtoriali*=i;
// }
// console.log(faqtoriali);


// 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6
// 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6

// თხოვეთ მომხმარებელს შემოიტანოს გარკვეული რიცხვი 100 დან
// 200 მდე და დაბეჭდეთ კონსოლში ყველა ის რიცხვი 0 დან
// მომხმარებლის მიერ შემოყვანილ რიცხვამდე რომელიც
// მომხმარებლის მიერ შემოყვანილ რიცხვს უნაშთოდ ყოფს.

// var inputNum = Number(prompt("choose number between 100-200"));

// while(inputNum<100||inputNum>200){
//     inputNum = Number(prompt("choose number between 100-200 CORRECTLY"));
// }

// for(var i = 0; i<=inputNum; i++){
//     if(inputNum%i==0){
//         console.log(i);
//     }
// }


// 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7
// 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7

// Თხოვეთ მომხმარებელს შემოიტანოს რიცხვი და დაადგინეთ ეს
// რიცხვი მარტივია თუ შედგენილი
// Რიცხვი არის მარტივი თუ მას 2 გამყოფი ყავს 1 და საკუთარი თავი,
// რიცხვი არის შედგენილი თუ მას 2 ზე მეტი გამყოფი ყავს, რიცხვი 1
// არც შედგენილია და არც მარტივი რადგან 1 გამყოფი ყავს

// var inputNum = Number(prompt("Enter number"));
// var isPrime = true;

//     if(inputNum==1){
//         console.log("ეს რიცხვი არც მარტივია, არც შედგენილი.")
//     }else{
//         for(var i=2; i<inputNum; i++){
//             if(inputNum%i==0){
//                 isPrime=false;
//                 break;
//             }else{
//                 isPrime=true;
//             }
//         }
//         if(isPrime){
//             console.log("ეს რიცხვი მარტივია");
//         }else{
//             console.log("ეს რიცხვი შედგენილია");
//         }
//     }

// console.log(inputNum);


// 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8
// 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8

// თხოვეთ მომხმარებელს შემოიტანოს რიცხვი და დაბეჭდეთ
// კონსოლში ყველა რიცხვის ნამრავლი რეზულტატი 1 დან
// მომხმარებლის მიერ შემოყვანილ რიცხვამდე

// var inputNum = Number(prompt("enter number"));
// var multiply = 1;
// for(var i = 1; i<=inputNum; i++){
//     multiply*=i;
// }
// console.log(multiply);


// 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9
// 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9

// თხოვეთ მომხმარებელს რომ შემოიტანოს რიცხვი 1 დან 10 მდე და
// დაბეჭდეთ კონსოლში მომხმარებლის მიერ შემოტანილ რიცხვზე
// გამრავლების ტაბულა


// var inputNum = Number(prompt("choose number between 1-10"));

// while(inputNum<1||inputNum>10){
//     inputNum = Number(prompt("choose number between 1-10 CORRECTLY"));
// }

// for(var i=1; i<=10; i++){
//     console.log(`${inputNum} * ${i} = ${inputNum*i}`);
// }